typedef unsigned short uint16;
typedef unsigned int uint32;
typedef unsigned char byte;

uint16 *ioram = (uint16 *) 0x04000000;
uint16 *map = (uint16 *) 0x06008000;;// マップのアドレス(タイルと被らないようにする)
uint16 *tile = (uint16 *) 0x06000000;// タイルのアドレス(マップと被らないようにする)
uint16 *color = (uint16 *) 0x05000000;// パレットのアドレス
uint16 *bg0_control = (uint16 *) 0x04000008;

int main() {
    uint32 x = 0;
    uint32 y = 0;
    // カラーパレットの定義(未定義部分は透明になる)
    color[1] = 0x7C00; // 青
    color[2] = 0xFFFF;// 白

	// tile1の形を配列で決める(8x8)
    byte tile1[] = {
        2,1,1,1,1,1,1,2,
        1,2,1,1,1,1,2,1,
        1,1,2,1,1,2,1,1,
        1,1,1,2,2,1,1,1,
        1,1,1,2,2,1,1,1,
        1,1,2,1,1,2,1,1,
        1,2,1,1,1,1,2,1,
        2,1,1,1,1,1,1,2
    };
	// tile2の形を配列で決める(8x8)
    byte tile2[] = {
        2,2,2,2,2,2,2,2,
        2,1,1,1,1,1,1,2,
        2,1,1,1,1,1,1,2,
        2,1,1,1,1,1,1,2,
        2,1,1,1,1,1,1,2,
        2,1,1,1,1,1,1,2,
        2,1,1,1,1,1,1,2,
        2,2,2,2,2,2,2,2
    };

    // 配列で決めたタイルの形をタイルのメモリに格納する(1枚目が透明なタイル，2枚目がtile1，3枚目がtile2)
    for (int i = 0; i < 32; i++){
        tile[i] = 0;
        tile[32 + i] = (uint16)(tile1[(i * 2)+1] << 8 | tile1[i * 2]);
        tile[64 + i] = (uint16)(tile2[(i * 2)+1] << 8 | tile2[i * 2]);
    }

    // 透明なタイルをマップに書き込んで初期化
    for (int i = 0; i < 20; i++)
        for (int j = 0; j < 32; j++)
            map[(i * 32 + j)] = 0;

    *bg0_control = 0x1080;  // 5. モード0
    *ioram = 0x0100; // 6. BG0を有効

	// 以下タイルを任意の場所に貼る処理
    //1段目
    map[y * 32 + x] = 1; // 左上隅にtile1を貼る
    x = 1;
    map[y * 32 + x] = 2; // 左上隅の隣にtile2を貼る
    x = 29;
    map[y * 32 + x] = 1; // 右上隅にtile1を貼る
    //2段目
    y = 1;
    x = 0;
    map[y * 32 + x] = 2; // 上段から2段目の左上隅にtile2を貼る
    x = 1;
    map[y * 32 + x] = 1; // 上段から2段目の左上隅の隣にtile1を貼る
    x = 29;
    map[y * 32 + x] = 2; // 上段から2段目の右上隅の隣にtile2を貼る
    //20段目
    y = 19;
    x = 0;
    map[y * 32 + x] = 2; // 左下隅にtile2を貼る
    x = 1;
    map[y * 32 + x] = 1; // 左下隅の隣にtile1を貼る
    x = 28;
    map[y * 32 + x] = 1; // 右下隅の隣にtile1を貼る
    x = 29;
    map[y * 32 + x] = 1; // 右下隅にtile1を貼る

    while(1){}
}
