typedef unsigned short uint16;
typedef unsigned char byte;

volatile uint16 *oam = ((volatile uint16 *)0x07000000);
volatile uint16 *tile_obj = (volatile uint16 *)0x06010040;
volatile uint16 *tile = (volatile uint16 *)0x06000000;
volatile uint16 *ioram = (volatile uint16 *)0x04000000;
volatile uint16 *palette = (volatile uint16 *) 0x05000200;

int main()
{
    palette[1] = 0x7C00; // 青
    palette[2] = 0xFFFF;// 白
    byte tile1[] = {
        2,1,1,1,1,1,1,2,
        1,2,1,1,1,1,2,1,
        1,1,2,1,1,2,1,1,
        1,1,1,2,2,1,1,1,
        1,1,1,2,2,1,1,1,
        1,1,2,1,1,2,1,1,
        1,2,1,1,1,1,2,1,
        2,1,1,1,1,1,1,2
    };
    byte tile2[] = {
        2,1,1,1,1,1,1,2,
        2,2,1,1,1,1,2,2,
        2,2,2,1,1,2,2,2,
        2,2,2,2,2,2,2,2,
        2,2,2,2,2,2,2,2,
        2,2,2,1,1,2,2,2,
        2,2,1,1,1,1,2,2,
        2,1,1,1,1,1,1,2
    };
    byte tile3[] = {
        1,1,1,2,2,1,1,1,
        1,1,1,2,2,1,1,1,
        1,1,1,2,2,1,1,1,
        2,2,2,2,2,2,2,2,
        2,2,2,2,2,2,2,2,
        1,1,1,2,2,1,1,1,
        1,1,1,2,2,1,1,1,
        1,1,1,2,2,1,1,1
    };

    byte tile4[] = {
        2,2,2,2,2,2,2,2,
        2,2,2,2,2,2,2,2,
        2,2,2,2,2,2,2,2,
        2,2,2,2,2,2,2,2,
        2,2,2,2,2,2,2,2,
        2,2,2,2,2,2,2,2,
        2,2,2,2,2,2,2,2,
        2,2,2,2,2,2,2,2
    };

    for (int i = 0; i < 32; i++){
		// オブジェクト1
        tile_obj[i + 32 * 0] = (tile1[i * 2 + 1] << 8) | tile1[i * 2];
        tile_obj[i + 32 * 1] = (tile1[i * 2 + 1] << 8) | tile1[i * 2];
        tile_obj[i + 32 * 2] = (tile1[i * 2 + 1] << 8) | tile1[i * 2];
        tile_obj[i + 32 * 3] = (tile1[i * 2 + 1] << 8) | tile1[i * 2];

		// オブジェクト2
        tile_obj[i + 32 * 4] = (tile2[i * 2 + 1] << 8) | tile2[i * 2];
        tile_obj[i + 32 * 5] = (tile2[i * 2 + 1] << 8) | tile2[i * 2];
        tile_obj[i + 32 * 6] = (tile2[i * 2 + 1] << 8) | tile2[i * 2];
        tile_obj[i + 32 * 7] = (tile2[i * 2 + 1] << 8) | tile2[i * 2];

		// オブジェクト3
        tile_obj[i + 32 * 8] = (tile3[i * 2 + 1] << 8) | tile3[i * 2];

		// オブジェクト4
        tile_obj[i + 32 * 9] = (tile1[i * 2 + 1] << 8) | tile1[i * 2];
        tile_obj[i + 32 * 10] = (tile2[i * 2 + 1] << 8) | tile2[i * 2];
        tile_obj[i + 32 * 11] = (tile3[i * 2 + 1] << 8) | tile3[i * 2];
        tile_obj[i + 32 * 12] = (tile3[i * 2 + 1] << 8) | tile3[i * 2];

		// オブジェクト5
        tile_obj[i + 32 * 13] = (tile4[i * 2 + 1] << 8) | tile4[i * 2];
        tile_obj[i + 32 * 14] = (tile4[i * 2 + 1] << 8) | tile4[i * 2];
        tile_obj[i + 32 * 15] = (tile4[i * 2 + 1] << 8) | tile4[i * 2];
        tile_obj[i + 32 * 16] = (tile4[i * 2 + 1] << 8) | tile4[i * 2];
    }

    *ioram =  0x1140; // オブジェクトの配置方法を1次元・BG0を使用・オブジェクトを表示

    oam[0] = (uint16)0x2010; // Y座標を16・カラーモードを256色・形状を正方形に指定
    oam[1] = (uint16)0x4020; // X座標を32・形状を16x16
    oam[2] = 2; // オブジェクト1を指定(0x06000040からスタートなので2)

    oam[4] = (uint16)0x201F; // Y座標を31・カラーモードを256色・形状を正方形に指定
    oam[5] = (uint16)0x4000; // X座標を0・形状を16x16
    oam[6] = 10; // オブジェクト2を指定(一つ前のオブジェクトは4枚あるので8増えた位置になる)

    oam[8] = (uint16)0x201F; // Y座標を31・カラーモードを256色・形状を正方形に指定
    oam[9] = (uint16)0x004F; // X座標を79・形状を8x8
    oam[10] = 18; // オブジェクト3を指定(一つ前のオブジェクトは4枚あるので8増えた位置になる)

    oam[12] = (uint16)0x202F; // Y座標を47・カラーモードを256色・形状を正方形に指定
    oam[13] = (uint16)0x404F; // X座標を79・形状を16x16
    oam[14] = 20; // オブジェクト4を指定(一つ前のオブジェクトは1枚あるので1増えた位置になる)

    oam[16] = (uint16)0x603F; // Y座標を63・カラーモードを256色・形状を長方形に指定
    oam[17] = (uint16)0x404F; // X座標を79・形状を32x8
    oam[18] = 28; // オブジェクト5を指定(一つ前のオブジェクトは4枚あるので8増えた位置になる)

    while(1){}

    return 0;
}
